# RisersAtSameLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RisersAtSameLocation Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The highlighted risers have the same location along the boundary line. Please move one of the two risers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RisersAtSameLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RisersAtSameLocation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RisersAtSameLocation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace